perf/output_HIGH.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10000 max VUs, 1m50s max duration (incl. graceful stop):
              * default: Up to 10000 looping VUs for 1m20s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.7s), 00007/10000 VUs, 20 complete and 0 interrupted iterations
default   [   1% ] 00007/10000 VUs  0m00.7s/1m20.0s

running (0m01.7s), 00017/10000 VUs, 126 complete and 0 interrupted iterations
default   [   2% ] 00017/10000 VUs  0m01.7s/1m20.0s

running (0m02.7s), 00027/10000 VUs, 321 complete and 0 interrupted iterations
default   [   3% ] 00027/10000 VUs  0m02.7s/1m20.0s

running (0m03.7s), 00037/10000 VUs, 607 complete and 0 interrupted iterations
default   [   5% ] 00037/10000 VUs  0m03.7s/1m20.0s

running (0m04.7s), 00047/10000 VUs, 971 complete and 0 interrupted iterations
default   [   6% ] 00047/10000 VUs  0m04.7s/1m20.0s

running (0m05.7s), 00057/10000 VUs, 1405 complete and 0 interrupted iterations
default   [   7% ] 00057/10000 VUs  0m05.7s/1m20.0s

running (0m06.7s), 00066/10000 VUs, 1889 complete and 0 interrupted iterations
default   [   8% ] 00066/10000 VUs  0m06.7s/1m20.0s

running (0m07.7s), 00076/10000 VUs, 2481 complete and 0 interrupted iterations
default   [  10% ] 00076/10000 VUs  0m07.7s/1m20.0s

running (0m08.7s), 00086/10000 VUs, 3138 complete and 0 interrupted iterations
default   [  11% ] 00086/10000 VUs  0m08.7s/1m20.0s

running (0m09.7s), 00096/10000 VUs, 3897 complete and 0 interrupted iterations
default   [  12% ] 00096/10000 VUs  0m09.7s/1m20.0s

running (0m10.7s), 00209/10000 VUs, 4690 complete and 0 interrupted iterations
default   [  13% ] 00209/10000 VUs  0m10.7s/1m20.0s

running (0m11.7s), 00374/10000 VUs, 5731 complete and 0 interrupted iterations
default   [  15% ] 00374/10000 VUs  0m11.7s/1m20.0s

running (0m12.7s), 00539/10000 VUs, 6738 complete and 0 interrupted iterations
default   [  16% ] 00539/10000 VUs  0m12.7s/1m20.0s

running (0m13.7s), 00704/10000 VUs, 7900 complete and 0 interrupted iterations
default   [  17% ] 00704/10000 VUs  0m13.7s/1m20.0s

running (0m14.7s), 00869/10000 VUs, 9039 complete and 0 interrupted iterations
default   [  18% ] 00869/10000 VUs  0m14.7s/1m20.0s

running (0m15.7s), 01034/10000 VUs, 10241 complete and 0 interrupted iterations
default   [  20% ] 01034/10000 VUs  0m15.7s/1m20.0s

running (0m16.7s), 01199/10000 VUs, 11342 complete and 0 interrupted iterations
default   [  21% ] 01199/10000 VUs  0m16.7s/1m20.0s

running (0m17.7s), 01364/10000 VUs, 12593 complete and 0 interrupted iterations
default   [  22% ] 01364/10000 VUs  0m17.7s/1m20.0s

running (0m18.7s), 01529/10000 VUs, 13784 complete and 0 interrupted iterations
default   [  23% ] 01529/10000 VUs  0m18.7s/1m20.0s

running (0m19.7s), 01694/10000 VUs, 14916 complete and 0 interrupted iterations
default   [  25% ] 01694/10000 VUs  0m19.7s/1m20.0s

running (0m20.7s), 01859/10000 VUs, 16029 complete and 0 interrupted iterations
default   [  26% ] 01859/10000 VUs  0m20.7s/1m20.0s

running (0m21.7s), 02024/10000 VUs, 17218 complete and 0 interrupted iterations
default   [  27% ] 02024/10000 VUs  0m21.7s/1m20.0s

running (0m22.7s), 02189/10000 VUs, 18335 complete and 0 interrupted iterations
default   [  28% ] 02189/10000 VUs  0m22.7s/1m20.0s

running (0m23.7s), 02354/10000 VUs, 19463 complete and 0 interrupted iterations
default   [  30% ] 02354/10000 VUs  0m23.7s/1m20.0s

running (0m24.7s), 02519/10000 VUs, 20614 complete and 0 interrupted iterations
default   [  31% ] 02519/10000 VUs  0m24.7s/1m20.0s

running (0m25.7s), 02684/10000 VUs, 21913 complete and 0 interrupted iterations
default   [  32% ] 02684/10000 VUs  0m25.7s/1m20.0s

running (0m26.7s), 02849/10000 VUs, 23090 complete and 0 interrupted iterations
default   [  33% ] 02849/10000 VUs  0m26.7s/1m20.0s

running (0m27.7s), 03014/10000 VUs, 24308 complete and 0 interrupted iterations
default   [  35% ] 03014/10000 VUs  0m27.7s/1m20.0s

running (0m28.7s), 03179/10000 VUs, 25565 complete and 0 interrupted iterations
default   [  36% ] 03179/10000 VUs  0m28.7s/1m20.0s

running (0m29.7s), 03344/10000 VUs, 26705 complete and 0 interrupted iterations
default   [  37% ] 03344/10000 VUs  0m29.7s/1m20.0s

running (0m30.7s), 03509/10000 VUs, 27980 complete and 0 interrupted iterations
default   [  38% ] 03509/10000 VUs  0m30.7s/1m20.0s

running (0m31.7s), 03674/10000 VUs, 29230 complete and 0 interrupted iterations
default   [  40% ] 03674/10000 VUs  0m31.7s/1m20.0s

running (0m32.7s), 03839/10000 VUs, 30270 complete and 0 interrupted iterations
default   [  41% ] 03839/10000 VUs  0m32.7s/1m20.0s

running (0m33.7s), 04004/10000 VUs, 31488 complete and 0 interrupted iterations
default   [  42% ] 04004/10000 VUs  0m33.7s/1m20.0s

running (0m34.7s), 04169/10000 VUs, 32572 complete and 0 interrupted iterations
default   [  43% ] 04169/10000 VUs  0m34.7s/1m20.0s

running (0m35.7s), 04334/10000 VUs, 33667 complete and 0 interrupted iterations
default   [  45% ] 04334/10000 VUs  0m35.7s/1m20.0s

running (0m36.7s), 04499/10000 VUs, 34712 complete and 0 interrupted iterations
default   [  46% ] 04499/10000 VUs  0m36.7s/1m20.0s

running (0m37.7s), 04664/10000 VUs, 35853 complete and 0 interrupted iterations
default   [  47% ] 04664/10000 VUs  0m37.7s/1m20.0s

running (0m38.7s), 04829/10000 VUs, 36951 complete and 0 interrupted iterations
default   [  48% ] 04829/10000 VUs  0m38.7s/1m20.0s

running (0m39.7s), 04994/10000 VUs, 37886 complete and 0 interrupted iterations
default   [  50% ] 04994/10000 VUs  0m39.7s/1m20.0s

running (0m40.7s), 05159/10000 VUs, 39041 complete and 0 interrupted iterations
default   [  51% ] 05159/10000 VUs  0m40.7s/1m20.0s

running (0m41.7s), 05324/10000 VUs, 40263 complete and 0 interrupted iterations
default   [  52% ] 05324/10000 VUs  0m41.7s/1m20.0s

running (0m42.7s), 05489/10000 VUs, 41283 complete and 0 interrupted iterations
default   [  53% ] 05489/10000 VUs  0m42.7s/1m20.0s

running (0m43.7s), 05654/10000 VUs, 42351 complete and 0 interrupted iterations
default   [  55% ] 05654/10000 VUs  0m43.7s/1m20.0s

running (0m44.7s), 05819/10000 VUs, 43506 complete and 0 interrupted iterations
default   [  56% ] 05819/10000 VUs  0m44.7s/1m20.0s

running (0m45.7s), 05984/10000 VUs, 44523 complete and 0 interrupted iterations
default   [  57% ] 05984/10000 VUs  0m45.7s/1m20.0s

running (0m46.7s), 06149/10000 VUs, 45550 complete and 0 interrupted iterations
default   [  58% ] 06149/10000 VUs  0m46.7s/1m20.0s

running (0m47.7s), 06314/10000 VUs, 46614 complete and 0 interrupted iterations
default   [  60% ] 06314/10000 VUs  0m47.7s/1m20.0s

running (0m48.7s), 06479/10000 VUs, 47466 complete and 0 interrupted iterations
default   [  61% ] 06479/10000 VUs  0m48.7s/1m20.0s

running (0m49.7s), 06644/10000 VUs, 48530 complete and 0 interrupted iterations
default   [  62% ] 06644/10000 VUs  0m49.7s/1m20.0s

running (0m50.7s), 06809/10000 VUs, 49508 complete and 0 interrupted iterations
default   [  63% ] 06809/10000 VUs  0m50.7s/1m20.0s

running (0m51.7s), 06974/10000 VUs, 50456 complete and 0 interrupted iterations
default   [  65% ] 06974/10000 VUs  0m51.7s/1m20.0s

running (0m52.7s), 07139/10000 VUs, 51659 complete and 0 interrupted iterations
default   [  66% ] 07139/10000 VUs  0m52.7s/1m20.0s

running (0m53.7s), 07304/10000 VUs, 52633 complete and 0 interrupted iterations
default   [  67% ] 07304/10000 VUs  0m53.7s/1m20.0s

running (0m54.7s), 07469/10000 VUs, 53471 complete and 0 interrupted iterations
default   [  68% ] 07469/10000 VUs  0m54.7s/1m20.0s

running (0m55.7s), 07634/10000 VUs, 54638 complete and 0 interrupted iterations
default   [  70% ] 07634/10000 VUs  0m55.7s/1m20.0s

running (0m56.7s), 07799/10000 VUs, 55721 complete and 0 interrupted iterations
default   [  71% ] 07799/10000 VUs  0m56.7s/1m20.0s

running (0m57.7s), 07964/10000 VUs, 56963 complete and 0 interrupted iterations
default   [  72% ] 07964/10000 VUs  0m57.7s/1m20.0s

running (0m58.7s), 08129/10000 VUs, 58177 complete and 0 interrupted iterations
default   [  73% ] 08129/10000 VUs  0m58.7s/1m20.0s

running (0m59.7s), 08294/10000 VUs, 59332 complete and 0 interrupted iterations
default   [  75% ] 08294/10000 VUs  0m59.7s/1m20.0s

running (1m00.7s), 08459/10000 VUs, 60527 complete and 0 interrupted iterations
default   [  76% ] 08459/10000 VUs  1m00.7s/1m20.0s

running (1m01.7s), 08624/10000 VUs, 61757 complete and 0 interrupted iterations
default   [  77% ] 08624/10000 VUs  1m01.7s/1m20.0s

running (1m02.7s), 08789/10000 VUs, 62928 complete and 0 interrupted iterations
default   [  78% ] 08789/10000 VUs  1m02.7s/1m20.0s

running (1m03.7s), 08954/10000 VUs, 64170 complete and 0 interrupted iterations
default   [  80% ] 08954/10000 VUs  1m03.7s/1m20.0s

running (1m04.7s), 09119/10000 VUs, 65217 complete and 0 interrupted iterations
default   [  81% ] 09119/10000 VUs  1m04.7s/1m20.0s

running (1m05.7s), 09284/10000 VUs, 66460 complete and 0 interrupted iterations
default   [  82% ] 09284/10000 VUs  1m05.7s/1m20.0s

running (1m06.7s), 09449/10000 VUs, 67690 complete and 0 interrupted iterations
default   [  83% ] 09449/10000 VUs  1m06.7s/1m20.0s

running (1m07.7s), 09614/10000 VUs, 68792 complete and 0 interrupted iterations
default   [  85% ] 09614/10000 VUs  1m07.7s/1m20.0s

running (1m08.7s), 09779/10000 VUs, 70077 complete and 0 interrupted iterations
default   [  86% ] 09779/10000 VUs  1m08.7s/1m20.0s

running (1m09.7s), 09944/10000 VUs, 71087 complete and 0 interrupted iterations
default   [  87% ] 09944/10000 VUs  1m09.7s/1m20.0s

running (1m10.7s), 10000/10000 VUs, 72154 complete and 0 interrupted iterations
default   [  88% ] 10000/10000 VUs  1m10.7s/1m20.0s

running (1m11.7s), 10000/10000 VUs, 73172 complete and 0 interrupted iterations
default   [  90% ] 10000/10000 VUs  1m11.7s/1m20.0s

running (1m12.7s), 09911/10000 VUs, 74192 complete and 0 interrupted iterations
default   [  91% ] 09911/10000 VUs  1m12.7s/1m20.0s

running (1m13.7s), 09719/10000 VUs, 75365 complete and 0 interrupted iterations
default   [  92% ] 09719/10000 VUs  1m13.7s/1m20.0s

running (1m14.7s), 09483/10000 VUs, 76318 complete and 0 interrupted iterations
default   [  93% ] 09483/10000 VUs  1m14.7s/1m20.0s

running (1m15.7s), 09027/10000 VUs, 77388 complete and 0 interrupted iterations
default   [  95% ] 09027/10000 VUs  1m15.7s/1m20.0s

running (1m16.7s), 08551/10000 VUs, 78310 complete and 0 interrupted iterations
default   [  96% ] 08551/10000 VUs  1m16.7s/1m20.0s

running (1m17.7s), 07789/10000 VUs, 79442 complete and 0 interrupted iterations
default   [  97% ] 07787/10000 VUs  1m17.7s/1m20.0s

running (1m18.7s), 07022/10000 VUs, 80441 complete and 0 interrupted iterations
default   [  98% ] 07021/10000 VUs  1m18.7s/1m20.0s

running (1m19.7s), 06090/10000 VUs, 81471 complete and 0 interrupted iterations
default   [ 100% ] 06090/10000 VUs  1m19.7s/1m20.0s

running (1m20.7s), 05009/10000 VUs, 82561 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m21.7s), 04023/10000 VUs, 83547 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m22.7s), 02934/10000 VUs, 84636 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m23.7s), 01806/10000 VUs, 85764 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m24.7s), 01806/10000 VUs, 85764 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m25.7s), 01806/10000 VUs, 85764 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m26.7s), 01806/10000 VUs, 85764 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m27.7s), 01806/10000 VUs, 85764 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m28.7s), 01806/10000 VUs, 85764 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m29.7s), 01806/10000 VUs, 85764 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m30.7s), 01654/10000 VUs, 85916 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m31.7s), 01500/10000 VUs, 86070 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m32.7s), 01345/10000 VUs, 86225 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m33.7s), 01181/10000 VUs, 86389 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m34.7s), 01016/10000 VUs, 86554 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m35.7s), 00852/10000 VUs, 86718 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m36.7s), 00687/10000 VUs, 86883 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m37.7s), 00522/10000 VUs, 87048 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m38.7s), 00357/10000 VUs, 87213 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m39.7s), 00192/10000 VUs, 87378 complete and 0 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m40.7s), 00118/10000 VUs, 87436 complete and 16 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

running (1m41.7s), 00094/10000 VUs, 87436 complete and 40 interrupted iterations
default ↓ [ 100% ] 05669/10000 VUs  1m20s

     ✗ status is 200
      ↳  98% — ✓ 85764 / ✗ 1684

     checks.........................: 98.07% 85764 out of 87448
     data_received..................: 18 MB  174 kB/s
     data_sent......................: 7.2 MB 71 kB/s
     http_req_blocked...............: avg=38.35µs min=0s       med=5.6µs   max=18.03ms p(90)=26.53µs p(95)=248.29µs
     http_req_connecting............: avg=24.81µs min=0s       med=0s      max=17.89ms p(90)=0s      p(95)=173.94µs
     http_req_duration..............: avg=4.14s   min=0s       med=4.35s   max=24.48s  p(90)=7.34s   p(95)=7.66s   
       { expected_response:true }...: avg=4.22s   min=5.44ms   med=4.39s   max=24.48s  p(90)=7.36s   p(95)=7.66s   
     http_req_failed................: 1.92%  1684 out of 87448
     http_req_receiving.............: avg=58.78µs min=0s       med=45.27µs max=8.82ms  p(90)=88.2µs  p(95)=114.25µs
     http_req_sending...............: avg=22.53µs min=0s       med=15.18µs max=8.82ms  p(90)=40.91µs p(95)=56.6µs  
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s      max=0s      p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=4.14s   min=0s       med=4.35s   max=24.48s  p(90)=7.34s   p(95)=7.66s   
     http_reqs......................: 87448  858.915538/s
     iteration_duration.............: avg=4.82s   min=105.81ms med=4.57s   max=30.13s  p(90)=7.59s   p(95)=7.84s   
     iterations.....................: 87436  858.797674/s
     vus............................: 94     min=7              max=10000
     vus_max........................: 10000  min=10000          max=10000


running (1m41.8s), 00000/10000 VUs, 87436 complete and 134 interrupted iterations
default ✓ [ 100% ] 00000/10000 VUs  1m20s